# Practice Case SQL and Python - IYKRA
## SQL Queries and Function in Jupyter Notebook

This is practice case in week 2 at Data Science Fellowship IYKRA.
I will answer some questions related dataset dvdrental from PostgreSQL and also make a function to print the introduction sentence.

First, I have to connect Jupyter Notebook with PostgreSQL.

In [2]:
#load ipython-sql
%load_ext sql

In [4]:
#%sql dialect+driver://username:password@host:port/database
%sql postgresql://postgres:a3@localhost/dvdrental

## Question 1
**A customer wants to know the films about “astronaut”. How many recommendations could you give for him?**

In [4]:
%%sql
select count(film_id)
from film
where description like '%_stronaut%'

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(78,)]

**So, there is 78 films about Astronout.**

## Question 2
**How many films have a rating of “R” and a replacement cost between $5 and 15?**

In [5]:
%%sql
select count(film) as count_of_film
from film
where rating = 'R' and replacement_cost between 5.0 and 15.0

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(52,)]

**So, there is 52 film that have a rating of “R” and a replacement cost between $5 and 15.**

## Question 3
**We want to give a bonus to the staff member that handled the most payments. How many payments did each staff member handle? And how much was the total amount processed by each staff member?**

In [6]:
%%sql
select staff_id, count(payment_id) as count_of_payment, sum(amount) as sum_of_payment
from payment
group by staff_id
order by count_of_payment desc

 * postgresql://postgres:***@localhost/dvdrental
2 rows affected.

[(2, 7304, Decimal('31059.92')), (1, 7292, Decimal('30252.12'))]

**So, the staff that have the higest amount in customer payment is staff id number 2.**

## Question 4
**Corporate headquarters is auditing the store, they want to know the average replacement cost of movies by rating.**

In [7]:
%%sql
select rating, avg(replacement_cost) as avg_replacement_cost
from film
group by rating
order by avg_replacement_cost desc

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[('PG-13', Decimal('20.4025560538116592')),
 ('R', Decimal('20.2310256410256410')),
 ('NC-17', Decimal('20.1376190476190476')),
 ('G', Decimal('20.1248314606741573')),
 ('PG', Decimal('18.9590721649484536'))]

**So, we can see the average replacement cost of movies by rating in the result above.**

## Question 5
**We want to send coupons to the 5 customers who have spent the most amount of money. Get the customer name, email and their spent amount!**

In [8]:
%%sql
select customer.customer_id, concat(customer.first_name,' ',customer.last_name) as "full_name", customer.email, sum(payment.amount) as sum_of_payment
from customer
inner join payment
on customer.customer_id = payment.customer_id
group by customer.customer_id
order by sum_of_payment desc
limit 5

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[(148, 'Eleanor Hunt', 'eleanor.hunt@sakilacustomer.org', Decimal('211.55')),
 (526, 'Karl Seal', 'karl.seal@sakilacustomer.org', Decimal('208.58')),
 (178, 'Marion Snyder', 'marion.snyder@sakilacustomer.org', Decimal('194.61')),
 (137, 'Rhonda Kennedy', 'rhonda.kennedy@sakilacustomer.org', Decimal('191.62')),
 (144, 'Clara Shaw', 'clara.shaw@sakilacustomer.org', Decimal('189.60'))]

**So, we have 5 customers with details information who have spent the most amount of money in the result above.**

## Question 6
**We want to audit our stock of films in all of our store. How many copies of each movie in each store do we have?**

In [15]:
%%sql
select inventory.store_id, count(inventory.film_id) as count_of_inventory, film.title
from inventory
inner join film
on inventory.film_id = film.film_id
group by inventory.store_id, film.title
order by film.title
limit 10

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[(2, 4, 'Academy Dinosaur'),
 (1, 4, 'Academy Dinosaur'),
 (2, 3, 'Ace Goldfinger'),
 (2, 4, 'Adaptation Holes'),
 (2, 3, 'Affair Prejudice'),
 (1, 4, 'Affair Prejudice'),
 (2, 3, 'African Egg'),
 (2, 3, 'Agent Truman'),
 (1, 3, 'Agent Truman'),
 (1, 2, 'Airplane Sierra')]

**So, we have information about the number of copies of each movie in each store in the result above.**

## Question 7
**We want to know what customers are eligible for our platinum credit card. The requirements are that the customer has at least a total of 40 transaction payments. Get the customer name, email who are eligible for the credit card!**

In [5]:
%%sql
select customer.customer_id, concat(customer.first_name,' ',customer.last_name) as "full_name", customer.email, count(payment.amount) as count_of_payment
from customer
inner join payment
on customer.customer_id = payment.customer_id
group by customer.customer_id
having count(payment.amount) >= 40
order by count_of_payment desc

 * postgresql://postgres:***@localhost/dvdrental
3 rows affected.

[(148, 'Eleanor Hunt', 'eleanor.hunt@sakilacustomer.org', 45),
 (526, 'Karl Seal', 'karl.seal@sakilacustomer.org', 42),
 (144, 'Clara Shaw', 'clara.shaw@sakilacustomer.org', 40)]

**So, we have 3 customers with details information who eligible for credit card.**

# This is function to print the introduction sentence.

In [7]:
def introduction(name, address, dob):
    print('My name is {}, I live in {}, I was born on {}'.format(name, address, dob))

introduction('Azmul', 'Jakarta', '16 May')

My name is Azmul, I live in Jakarta, I was born on 16 May